help = {"save_SAP": "Сохранение изображения РЛИ с САП",
        "ruler": "Измерение расстояния на изображении",


        "slider_contrast": "Изменение значения контраста РЛИ с САП",
        'slider_bright': "Изменение значения яркости РЛИ с САП",
        "slider_exp": "Изменение значения экспозиции РЛИ с САП",
        "bt_contrast_reset": "Восстановление значения контраста",
        "bt_bright_reset": "Восстановление значения яркости",
        "bt_exp_reset": "Восстановление значения экспозиции"



}