help = {"open_file":"Открытие радиолокационной голограммы\nили радиолакационного изображения",
        "get_RLI": "Преобразование файла радиолокационной голограммы\nв радиолакационное изображение",
        "save_full_RLI": "Сохранение изображения\nвидимой области левого окна",
        "fon_refresh": "Обновление значения фона",
        "btn_select_fon": "Установка области фона",
        "btn_solve_fon": "Расчет параметров САП с учетом области фона",
        "save_SAP": "Сохранение изображения РЛИ с САП",
        "ruler": "Измерение расстояния на изображении",


        "slider_contrast": "Изменение значения контраста РЛИ с САП",
        'slider_bright': "Изменение значения яркости РЛИ с САП",
        "slider_exp": "Изменение значения экспозиции РЛИ с САП",
        "bt_contrast_reset": "Восстановление значения контраста",
        "bt_bright_reset": "Восстановление значения яркости",
        "bt_exp_reset": "Восстановление значения экспозиции",
        "Kp": "Требуемое отношение помеха/фон",
        "Pg": "Требуемый энергопотенциал САП",

        "bright_back": "Уменьшение яркости РЛИ",
        "bright_forward": "Увеличение яркости РЛИ",
        "bright_reset": "Сброс яркости РЛИ",
        "contrast_back": "Уменьшение контраста РЛИ",
        "contrast_forward": "Увеличение контраста РЛИ",
        "contrast_reset": "Сброс контраста РЛИ",

        "blocker_open": "Заблокировать изображение РЛИ",
        "blocker_close": "Разблокировать изображение РЛИ",



}